import {Line} from "./rail-net-entity";

export const prodLines: Line[] = [
    {
        "name": "广惠城际",
        "color": "#7d5ba6",
        "stations": [
            "番禺",
            "广州长隆",
            "东环",
            "官桥北",
            "广州莲花山",
            "麻涌",
            "东莞西",
            "道滘",
            "西平西",
            "东城南",
            "寮步",
            "松山湖北",
            "大朗镇",
            "常平南",
            "常平东",
            "樟木头东",
            "银瓶",
            "沥林北",
            "陈江南",
            "惠环",
            "龙丰",
            "西湖东",
            "云山",
            "小金口",
            "惠州北"
        ],
        stationPairAdditions: {}
    },
    {
        "name": "广肇城际",
        "color": "#2874a6",
        "stations": [
            "番禺",
            "陈村",
            "北滘西",
            "顺德北",
            "张槎",
            "佛山西",
            "狮山",
            "狮山北",
            "三水北",
            "云东海",
            "大旺",
            "四会",
            "鼎湖东",
            "鼎湖山",
            "端州",
            "肇庆"
        ],
        stationPairAdditions: {}
    },
    {
        "name": "广清城际",
        "color": "#1e8449",
        "stations": [
            "花都",
            "乐同",
            "狮岭",
            "银盏",
            "龙塘镇",
            "清城",
            "燕湖",
            "洲心",
            "飞霞"
        ],
        stationPairAdditions: {}
    },
    {
        "name": "广州东环城际",
        "color": "#ca6f1e",
        "stations": [
            "花都",
            "花城街",
            "花山镇",
            "白云机场北",
            "白云机场南",
            "白云机场东",
            "竹料",
            "帽峰山",
            "大源",
            "龙洞",
            "岑村",
            "科韵路",
            "琶洲",
            "广州大学城",
            "大石东",
            "番禺"
        ],
        stationPairAdditions: {}
    },
    {
        "name": "穗深城际",
        "color": "#0aaf83",
        "stations": [
            "新塘南",
            "中堂",
            "望牛墩",
            "东莞西",
            "洪梅",
            "东莞港",
            "厚街",
            "虎门北",
            "虎门东",
            "长安西",
            "长安",
            "沙井西",
            "福海西",
            "深圳机场北",
            "深圳机场"
        ],
        stationPairAdditions: {}
    },
    {
        "name": "琶莲城际",
        "color": "#8bc539",
        "stations": [
            "琶洲",
            "深井",
            "化龙南",
            "广州莲花山"
        ],
        stationPairAdditions: {}
    },
    {
        "name": "广惠穗深联络线",
        "color": "#7c6070",
        "stations": [
            "麻涌",
            "洪梅"
        ],
        "stationPairAdditions": {
            "麻涌-洪梅": ["东莞西"],
            "洪梅-麻涌": ["东莞西"]
        }
    }
]